Tekla.Structures.Analysis.Remoting.ICDelegate.ExportFetchAnalysisModelIssue(Tekla.Structures.AnalysisInternal.DotAnalysisModelIssue@)
DO NOT USE! For internal usage only!
analysisModelIssue: The analysis model.
Returns: Returns TRUE if successfully deleted an analysis model.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportQueryAnalysisLoadGroup(Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroupQuery@)
DO NOT USE! For internal usage only!
loadGroupQuery: Analysis load group query.
Returns: Returns TRUE if successfull.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportUISetSelectedAnalysisObjects(System.Collections.Generic.List{Tekla.Structures.AnalysisInternal.dotADSelectedObject_t},System.Int32)
DO NOT USE! For internal usage only!
objects: The objects.
append: The append selection switch.
Returns: Returns the count of selected objects.

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportAnalysisObjectOperation(Tekla.Structures.AnalysisInternal.dotAnalysisObjectOperation_t@)
DO NOT USE! For internal usage only!
pOperation:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportAnalysisChangeManagementObjectsTimes(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementObjectsTimes@)
DO NOT USE! For internal usage only!
pObjectsTimes:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportAnalysisChangeManagementTime(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementTime@)
DO NOT USE! For internal usage only!
pTime:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportAnalysisChangeManagementPartBarData(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartBarData@)
DO NOT USE! For internal usage only!
pPartBarData:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportAnalysisChangeManagementOperation(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementOperation@)
DO NOT USE! For internal usage only!
pOperation:
Returns:

Tekla.Structures.Analysis.Remoting.ICDelegate.ExportAnalysisChangeManagementPartDiff(Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff@)
DO NOT USE! For internal usage only!
pPartDiff:
Returns: